app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index(): string
    {
        $data['users'] = $this->user->orderby('id','DESC')->paginate(3,'group1');

INSERT INTO `users` (`username`, `email`) VALUES ('Aditya', 'Adi@gamil.com')
---
    public function saveUser() {
    $username = $this->request->getVar('username');
    $email = $this->request->getVar('email');

    $this->user->save(["username" => $username, "email" => $email]);

SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1
---
  public function getSingleUser($id){
    $data = $this->user->where('id', $id)->first();

UPDATE `users` SET `username` = 'Rishove ghosh', `email` = 'rishi@gmail.com'
WHERE `users`.`id` IN ('3')
---
public function updateUser(){
    $id = $this->request->getVar('updateId');
    $username = $this->request->getVar('username');
    $email = $this->request->getVar('password');

    $data['username'] = $username;
    $data['email'] = $email;

    $this->user->update($id, $data);

DELETE FROM `users`
WHERE `id` IN ('5')
---
  public function deleteUser() {
    $id = $this->request->getVar('id');
    $this->user->delete($id);